#language: ru
@1
Функционал: Поиск на авито
  Сценарий: Найдем самые дорогие принтеры на авито
    Пусть открыт ресурс авито
    И в выподающем списке котегорий выбрано ОРГТЕХНИКА
    И в поле поиска введено значение 'принтер'
    Тогда кликнуть по выподающему списку региона
    Тогда в поле региона введено значение 'Владивосток'
    И нажата кнопка показать объявление
    Тогда открылась страница результаты по запросу принтер
    И активирован чекбокс только с фотографией
    И в выподающем списке сортировка выбрано значение ДОРОЖЕ
    И в консоль выведено значение название и цены 3 первых товаров


